[
  {
    "description": "Chicken Korma",
    "source": "www.simplyrecipes.com",
    "url": "https://www.simplyrecipes.com/recipes/chicken_korma/",
    "prepTime": "10",
    "cookTime": "45",
    "servings": "4",
    "note": {
      "recipeNotes": "I did not grow up on chicken korma.\n\nGrowing up in a traditional Indian home, chicken was served maybe a couple times a week. Although those meals would be a treat, chicken curry was mainly what my mom cooked.\n\nKormas are for very, very special occasions, like weddings or grand parties, and rightfully so! They are so rich and luxurious. Pieces of chicken are gently simmered in a rich, creamy sauce with layers of sweet and spicy flavors. This dish is what dreams are made of!"
    },
    "difficulty": "HARD",
    "categories": [
      {
        "description": "indian"
      }
    ],
    "ingredients": [
      {
        "description": "raw almonds",
        "amount": 15,
        "unitOfMeasure": {
          "uom": "number"
        }
      },
      {
        "description": "green cardamom pods",
        "amount": 3,
        "unitOfMeasure": {
          "uom": "number"
        }
      },
      {
        "description": "freshly cracked peppercorn",
        "amount": 0.5,
        "unitOfMeasure": {
          "uom": "teaspoon"
        }
      }
    ],
    "preparationSteps": [
      {
        "priority": 1,
        "title": "Make the almond paste",
        "description": "Soak the almonds in 1/2 cup water for approximately 2 hours. Peel the skins off. In a blender (I use Nutribullet) grind the almonds into a smooth paste. Feel free to add 1-2 tablespoons of additional water to help with a smooth grinding."
      },
      {
        "priority": 2,
        "title": "Marinade the chicken",
        "description": "In a medium-sized mixing bowl combine yogurt, turmeric, ginger garlic paste, salt, and cayenne pepper. Using a spoon or a whisk, mix it all together. Add chicken to the marinade. Coat the chicken well with marinade. Cover with a plate and set aside in the refrigerator for 1 hour."
      },
      {
        "priority": 3,
        "title": "Fry the onions",
        "description": "Heat oil in a Dutch oven over medium-high heat. Line a plate or sheet pan with paper towels and set this near the stove. Check to see if the oil is hot enough by dropping a strand of onion into the pot. If it sizzles then the oil is ready. Add the rest of the onions to the pot.\n\nCook for 7-10 minutes on medium-high heat while moving them around until the onions turn golden brown. Use a slotted spoon to take the onions out of the oil and spread into the paper-towel-lined plate or sheet pan lined to soak up the excess oil.\n\nSet aside for later. You will use these onions to make a paste. Leave about 1 tablespoon of oil in the pot and discard the rest."
      }
    ]
  }
]
